Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Невозможно изменить тип данных узла, который является контейнером
en: Failed to change the data type of the node that is a container

source: Невозможно изменить признак контейнера у узла, который является корневым или содержит дочерние узлы
en: Failed to change the container indicator of a node that is a root node, or contains child nodes

source: В списке исключений найдены дубликаты: %s
en: Duplicates detected in the list of exceptions: %s

source: Узел "%s" типа "%s" не может быть непрерывным
en: "%s" node of "%s" type cannot be continuous

source: Только узел, являющийся контейнером, может содержать дочерние узлы
en: Only container node can have subnodes

source: Назначение "%s" недопустимо для настраиваемого узла "%s"
en: Usage type "%s" is not valid for the configurable node "%s"

source: Тип узла %s не совместим с типом исходного узла %s
en: %s node type is not compatible with %s source node type

source: Узел по пути %s не найден
en: Node in path %s not found

source: Ссылка на узел не задана
en: Reference to node not specified

source: Тип узла %s не совместим с типом исходного узла
en: %s node type doesn't match the source node type

source: %s %s %s от %s
en: %s %s %s from %s

source: Не найдена процедура, загружаемая отложено
en: No delayed loaded procedure found

source: Объект обработчика события удален
en: Event handler object disposed

source: Точка соединения поддерживает только одно подключение
en: Connection point supports only one connection

source: У точки соединения отсутствует подключение
en: Connection point has no connection

source: Невозможно изменять имя производных элементов коллекции
en: It is not possible to change the derived collection item name

source: Невозможно изменять тип данных производных полей
en: It is not possible to change the derived field data type

source: Удаление производных элементов коллекции невозможно
en: It is not possible to delete the derived collection items

source: Изменение позиции производных элементов коллекции невозможно
en: It is not possible to change position of the derived collection items

source: Обязательному входному столбцу %s не сопоставлен выходной
en: The required input column %s has not been mapped to the output column

source: Не удалось найти исходный столбец %s для выходного столбца %s
en: Failed to find source %s column for output %s column

source: Выходному столбцу %s не сопоставлен входной столбец
en: The required output column %s has not been mapped to the input column

source: Обязательному входному узлу %s не сопоставлен выходной
en: The required input node %s has not been mapped to the output node

source: Не удалось найти исходный узел %s для выходного узла %s
en: Failed to find source %s node for output %s node

source: Выходному узлу %s не сопоставлен входной узел
en: The output node %s has not been mapped to the input node

source: Обязательной входной переменной %s не сопоставлена выходная
en: The required input variable %s has not been mapped to the output variable

source: Не удалось найти исходную переменную %s для выходной переменной %s
en: Failed to find the source variable %s for the configurable variable %s

source: Выходной переменной %s не сопоставлена входная переменная
en: The input variable %s has not been mapped to the output variable

source: В функцию %s передано недостаточно аргументов (%d, когда минимум %d)
en: Few arguments supplied to %s function (%d whereas %d is minimum number)

source: Тип переменной %s не совместим с типом исходной переменной %s
en: %s variable type is not compatible with %s source variable type

source: Кодовая страница с номером %d не поддерживается
en: Codepage with number %d not supported

source: Строка "%s" не может быть преобразована в строку с кодировкой ASCII
en: "%s" string cannot be converted to ASCII encoded string

source: Перечисление "%s" не зарегистрировано
en: "%s" enumeration not registered

source: Внутреннее исключение неизвестного типа %s удалено
en: Internal unknown exception of %s type disposed

source: КЛАСС ИСКЛЮЧЕНИЯ: %s
en: EXCEPTION CLASS: %s

source: СООБЩЕНИЕ: %s
en: MESSAGE: %s

source: ОТПРАВИТЕЛЬ: %s
en: SENDER: %s

source: ТРАССА: %s
en: STACK TRACE: %s

source: Вызов абстрактного метода %s
en: Abstract method calling %s

source: Вызов абстрактного метода %s.%s
en: Abstract method calling %s.%s

source: Невозможно присвоить значениям свойств объекта %s значения объекта неподдерживаемого класса %s
en: Failed to assign property values of %s object to the object values of the unsupported class %s

source: Невозможно присвоить значениям свойств объекта %s значения объекта неподдерживаемого интерфейса
en: Failed to assign property values of %s object to the object values of the unsupported interface

source: Поле %s должно быть проинициализировано
en: %s field must be initialized

source: Значение параметра "%s" равное NaN недопустимо
en: "%s" parameter value equal to NaN is not allowed

source: Ссылка на функцию %s должна быть проинициализирована
en: Reference to %s function must be initialized

source: Значение индекса %d параметра "%s" вне диапазона [%d, %d]
en: Index value %d of "%s" parameter is out of [%d, %d] range

source: Недопустимое значение параметра %s метода %s: "%s"
en: Invalid value of %s parameter for %s method: "%s"

source: Недопустимое значение параметра %s: "%s"
en: Invalid value of %s parameter: "%s"

source: Недопустимые значения параметров
en: Invalid parameter values

source: Параметр %s метода %s должен быть проинициализирован
en: %s parameter of %s method must be initialized

source: Значение %g параметра "%s" должно быть больше или равно %g
en: Value %g of "%s" parameter must be more than or equal to %g

source: Значение %d параметра "%s" должно быть больше или равно %d
en: Value %d of "%s" parameter must be more than or equal to %d

source: Значение %g параметра "%s" должно быть больше %g
en: Value %g of "%s" parameter must be more than %g

source: Значение %d параметра "%s" должно быть больше %d
en: Value %d of "%s" parameter must be more than %d

source: Значение %g параметра "%s" должно быть меньше или равно %g
en: Value %g of "%s" parameter must be less than or equal to %g

source: Значение %d параметра "%s" должно быть меньше или равно %d
en: Value %d of "%s" parameter must be less than or equal to %d

source: Значение %g параметра "%s" должно быть меньше %g
en: Value %g of "%s" parameter must be less than %g

source: Значение %d параметра "%s" должно быть меньше %d
en: Value %d of "%s" parameter must be less than %d

source: Значение %g параметра "%s" вне диапазона [%g, %g]
en: Value %g of "%s" parameter is out of range [%g, %g]

source: Значение %d параметра "%s" вне диапазона [%d, %d]
en: Value %d of "%s" parameter is out of [%d, %d] range

source: Параметр %s должен быть проинициализирован
en: %s parameter must be initialized

source: Свойство %s должно быть проинициализировано
en: %s property must be initialized

source: Свойство %s доступно только на чтение
en: %s property is read-only

source: Невозможно извлечь из контекста выполнения элемент с ключом %s, который не совпадает с текущим элементом в контексте
en: Failed to retrieve the element with %s key from the execution context that does not match the current element in the context

source: Невозможно зарегистрировать внешний контекст выполнения: контекст уже существует
en: Failed to install the external execution context: context already exists

source: Используемый контекст выполнения не является внешним
en: The execution context used is not external

source: Внешний контекст выполнения не зарегистрирован
en: The external execution context not installed

source: В контексте выполнения отсутствует элемент с ключом %s
en: No element with %s key in the execution context

source: Не поддерживается удаление контекста выполнения из параллельного потока, пока существует поток, в котором он создан
en: Deleting execution context from parallel thread is not supported while the thread in which it has been created exists

source: Число ячеек экспортируемой таблицы превышает допустимый максимум в %d ячеек
en: Number of cells in the exported table exceeds the allowable maximum of %d

source: Число колонок экспортируемой таблицы превышает допустимый максимум в %d колонок
en: Number of columns in the exported table exceeds the allowable maximum of %d

source: Число строк экспортируемой таблицы превышает допустимый максимум в %d строк
en: Number of rows in the exported table exceeds the allowable maximum of %d

source: Число колонок экспортируемой таблицы %d превышает допустимый максимум в %d колонок
en: Number of columns %d in the exported table exceeds the allowable maximum of %d

source: Число строк экспортируемой таблицы %d превышает допустимый максимум в %d строк
en: Number of rows %d in the exported table exceeds the allowable maximum of %d

source: Во время закрытия генератора данных произошла ошибка: %s
en: Error occurred while closing the data generator: %s

source: Невозможно чтение: поток был принудительно остановлен.
en: Failed to read: stream was forcedly stopped.

source: Для базового идентификатора %s имеется несколько расширений
en: There are several extensions for %s base identifier

source: Расширение для базового идентификатора %s не найдено
en: No extension for %s base identifier found

source: Расширение с индексом %d удалить нельзя
en: Failed to delete extension with index %d

source: Расширение "%s" уже существует
en: "%s" extension already exists

source: Расширение уже проинициализировано
en: Extension already initialized

source: Явное удаление экземпляра списка расширений запрещено
en: Explicit deletion of the extension list instance is forbidden

source: Расширение %s не поддерживается
en: %s extension not supported

source: вендор расширений
en: extension vendor

source: Расширение %s не загружено, т.к. конфигурация не найдена
en: %s extension not loaded as configuration not found

source: Расширение не загружено, т.к. вендор расширения %s не найден
en: Extension not loaded as %s extension vendor not found

source: Следующие настраиваемые расширения отличаются от исходных: %s. Вы хотите синхронизировать все расширения?
en: The following configured extensions differ from the original ones: %s. Do you want to sync all extensions?

source: Формат отображения
en: Display Format

source: Поле с именем %s не найдено
en: Field with %s name not found

source: Ссылка на столбец или переменную не задана
en: No link to column or variable set

source: Тип поля %s не совместим с типом исходного поля
en: %s field type is not compatible with the source field type

source: Расширенный метафайл
en: Extended metafile

source: Формат GIF
en: GIF format

source: Файл справки
en: Help file

source: Формат JPEG
en: JPEG format

source: Файлы JavaScript
en: JavaScript files

source: Файлы Python
en: Python files

source: Файлы в формате RTF
en: Files in RTF format

source: Файлы запросов
en: Request files

source: В функцию %s передано много аргументов (%d, когда максимум %d)
en: Too many arguments supplied to %s function (%d whereas %d is maximum number)

source: Формат shape
en: Shape format

source: Файлы конструктора запросов
en: Query designer files

source: SQL-файлы
en: SQL files

source: Метафайл
en: Metafile

source: Файлы XML
en: XML files

source: Файлы XML-схемы
en: XML schema files

source: Невозможно создать директорию: %s
en: Failed to create folder: %s

source: Директория с именем %s уже смонтирована
en: Directory with %s name is already mounted

source: Директория "%s" не существует
en: "%s" directory does not exist

source: Ошибка доступа к файлу: %s
en: Error accessing file: %s

source: Файл "%s" не существует
en: "%s" file does not exist

source: Хранилище файлов не подключено
en: File storage not connected

source: Недопустимое имя файла резервной копии: %s
en: Invalid backup file name: %s

source: Недопустимая текущая директория: %s
en: Invalid current directory: %s

source: Недопустимое имя монтируемой директории: %s
en: Invalid mounted directory name: %s

source: Указанный путь к монтируемой директории не является абсолютным путём: "%s"
en: The specified path to the mounted directory is not an absolute path: "%s"

source: Не смонтировано ни одной директории
en: No directories mounted

source: Корневое хранилище файлов не подключено
en: Root file storage not connected

source: Удаление директории %s со всем её содержимым
en: Remove directory %s with all contents

source: Ошибка форматирования
en: Format error

source: Элемент CSS с именем "%s" уже существует
en: CSS item with "%s" name already exists

source: Элемент CSS с именем "%s" не найден
en: CSS element with "%s" name not found

source: Ошибка инициализации контекста объекта %p
en: Error initializing context of object %p

source: Контейнер контекста уже проинициализирован
en: Context container already initialized

source: Контекст не содержит объект с идентификатором %s
en: Context does not contain the object with %s identifier

source: Обрабатываемый элемент не принадлежит указанному списку
en: The processed item does not belong to the specified list

source: Поток данных открыт в режиме только на чтение
en: The data stream is open in the read-only mode

source: При чтении байтов из потока данных вместо %d было прочитано %d
en: When reading bytes from the data stream, %1:d was read instead of %0:d

source: Недопустимые значения параметров при чтении из потока данных: Length = %d; Count = %d; Offset = %d
en: Invalid parameter values when reading from the data stream: Length = %d; Count = %d; Offset = %d

source: При чтении из потока данных размер результирующего буфера %d меньше чем число байт необходимое для чтения %d
en: When reading from the data stream, the resulting buffer size of %d is less than the number of bytes %d required for reading

source: При перемещении курсор потока данных вышел за пределы 2 Гб, необходимо использовать 64-й аналог функции
en: When moving, the cursor of the data stream went beyond 2 GB, it is required to use the 64-bit version of the function

source: При записи байтов в поток данных вместо %d было записано %d
en: When writing bytes to the data stream, %1:d was written instead of %0:d

source: Недопустимые значения параметров при записи в поток данных: Length = %d; Count = %d; Offset = %d
en: Invalid parameter values when writing to the data stream: Length = %d; Count = %d; Offset = %d

source: При записи в поток данных размер исходного буфера %d меньше чем число байт необходимое для записи %d
en: When writing to the data stream, the initial buffer size of %d is less than the number of bytes %d required for writing

source: Ошибка добавления JSON узла
en: Error adding JSON node

source: Некорректный JSON массив
en: Invalid JSON array

source: Некорректное JSON число
en: Invalid JSON number

source: Некорректный JSON объект
en: Invalid JSON object

source: Некорректная JSON строка
en: Invalid JSON string

source: Недопустимое значение "%s"
en: Invalid "%s" value

source: Ошибка парсинга JSON
en: Error parsing JSON

source: Получен символ %s вместо ожидаемого %s
en: %s character received instead of expected %s

source: Неопределенное JSON значение
en: Undefined JSON value

source: Парсер JSON не инициализирован
en: JSON parser not initialized

source: Недопустимый шаблон даты времени "%s"
en: Invalid datetime template "%s"

source: Недопустимая управляющая последовательность символов
en: Invalid escape sequence

source: Локаль "%s" не поддерживается
en: "%s" locale not supported

source: Двумерный динамический массив не является прямоугольной матрицей
en: Two-dimensional dynamic array is not rectangular matrix

source: Необходимая длина M-последовательности должна быть больше 0
en: The required M-sequence length must be more than 0

source: Значение сдвигового регистра не может равняться нулю или превышать длину последовательности.
en: The shift register value cannot be equal to zero or exceed the sequence length.

source: Невозможно преобразовать переменную типа Variant в значение типа TVarRec из-за неподдерживаемого типа данных %d переменной типа Variant
en: Failed to convert the Variant variable to the TVarRec value due to the unsupported data type %d of the Variant variable

source: Невозможно преобразовать переменную типа TVarRec в значение типа Variant из-за неподдерживаемого типа данных %d переменной типа TVarRec
en: Failed to convert the TVarRec variable to the Variant value due to the unsupported data type %d of the TVarRec variable

source: Действие уже начато
en: Action has already been started

source: Cookie действия объекта принадлежит другому объекту
en: The object action Cookie belongs to another object

source: Действие не начато
en: Action hasn't been started

source: Объект удалён раньше, чем Cookie действия объекта
en: The object has been disposed before the object action Cookie

source: Найдены правила с одинаковыми параметрами (дубликаты)
en: Rules with the same parameters (duplicates) detected

source: Невозможно изменить максимальное количество сохранённых процессов: буфер сохранённых процессов уже используется
en: Failed to change the maximum count of saved processes: buffer of saved processes has already been used

source: Нельзя добавить подпроцесс к некорректно завершенному процессу
en: Failed to add subprocess to the incorrectly terminated process

source: Ошибка преобразования значения из скалярного типа данных
en: Error converting value from the scalar data type

source: Ошибка преобразования значения к скалярному типу данных
en: Error converting value to the scalar data type

source: сборочные метаданные
en: built metadata

source: Маска версии должна иметь формат: ^Мажорная[.Минорная[.Патч[-ПредрелизнаяВерсия]]]
en: Version mask must have the following format: ^Major[.Minor[.Patch[-Pre-releaseVersion]]]

source: Идентификатор "%s" содержит недопустимый символ: %s
en: "%s" identifier contains invalid character: %s

source: "%s" не является допустимой маской версии
en: "%s" is not a valid version mask

source: "%s" не является допустимым номером версии
en: "%s" is not a valid version number

source: Маска версии должна иметь формат: ~Мажорная[.Минорная[.Патч[-ПредрелизнаяВерсия]]]
en: Version mask must have the following format: ~Major[.Minor[.Patch[-Pre-releaseVersion]]]

source: Версия должна иметь формат: Мажорная.Минорная.Патч[-ПредрелизнаяВерсия][+СборочныеМетаданные]
en: Version must have the following format: Major.Minor.Patch[-Pre-releaseVersion][+Built Metadata]

source: Часть "%s" содержит пустой идентификатор: "%s"
en: "%s" part contains an empty identifier: "%s"

source: Элемент номера версии "%s" содержит ведущий нуль
en: "%s" version number element contains leading zero

source: Часть "%s" является пустой строкой
en: "%s" part is an empty string

source: Элемент номера версии "%s" является отрицательным
en: "%s" version number element is negative

source: Маска версии должна иметь формат: [Мажорная.[Минорная.]]*
en: Version mask must have the following format: [Major.[Minor.]]*

source: предрелизная версия
en: prerelease version

source: Служебные переменные уже проинициализированы
en: Service variables have already been initialized

source: В функции QuickSelect левая граница %d задана больше правой %d
en: The left bound %d has been set higher than the right one %d in QuickSelect function

source: Элемент с индексом %d не существует
en: Item with index %d does not exist

source: Статистические ограничения
en: Statistic Constraints

source: Пропущенные значения запрещены (пропущенное значение в колонке "%s")
en: Null values are not allowed (null value in "%s" column)

source: Индекс или имя столбца
en: Column Index or name

source: При расчете списка уникальных значений возникли ошибки
en: Errors occurred while calculating the list of unique values

source: В поле "%s" обнаружено ранее отсутствовавшее пустое значение
en: Previously missing null value was found in "%s" field

source: В поле "%s" обнаружено ранее отсутствовавшее значение "%s"
en: Previously missing "%1:s" value was found in "%0:s" field

source: Cookie построителя статистики принадлежит другому объекту
en: The statistics builder Cookie belongs to another object

source: Попытка выполнить операцию завершения расчета с пустой ссылкой на Cookie построителя статистики
en: Attempt to complete the calculation completion operation with null reference to the statistics builder Cookie

source: Длина массива количеств значений не совпадает с количеством уникальных значений
en: The array length of the values count does not match the unique values count

source: Данный функционал не реализован
en: This functionality not implemented

source: Длина массива индексов не соответствует количеству уникальных значений
en: The index array length does not match the unique values count

source: Некорректный класс источника синхронизации. Ожидается экземпляр класса %s, фактически %s
en: Invalid synchronization source class. Expected instance of %s class, actually %s

source: Строка "%s" не может быть преобразована в значение типа дата/время
en: "%s" string cannot be converted to the date/time value

source: Переход в начало потока не возможен, т.к. уже прочитано %d байт, что больше чем размер кэша %d
en: It is not possible to move to the stream start as %d bytes already are read and it exceeds %d cache size

source: Строка "%s" не может быть преобразована в значение логического типа
en: "%s" string cannot be converted to the boolean value

source: Строка "%s" не может быть преобразована в значение вещественного типа
en: "%s" string cannot be converted to the real type value

source: Строка "%s" не является правильным представлением шестнадцатеричного числа
en: String "%s" is not a valid representation of a hexadecimal number

source: Размер создаваемой строки превысил максимальный в 2Гб
en: The new string size exceeds the maximum of 2 GB

source: Инвариантная
en: Invariant

source: Явно не задана
en: Unspecified

source: Нельзя уменьшить уровень блокировки синхронизатора %p с блокировки на запись до блокировки на чтение, предварительно не увеличив уровень
en: Failed to downgrade synchronizer %p from write lock to read lock before upgrading

source: Синхронизатор %p финализирован
en: Synchronizer %p finalized

source: Нельзя заблокировать на чтение синхронизатор %p, который уже заблокирован из того же потока
en: Failed to lock for reading synchronizer %p that has already been locked from the same stream

source: Нельзя заблокировать на запись синхронизатор %p, который уже заблокирован из того же потока
en: Failed to lock for writing synchronizer %p that has already been locked from the same stream

source: Нельзя увеличить уровень блокировки синхронизатора %p с блокировки на чтение до блокировки на запись, предварительно не заблокировав его на чтение
en: Failed to increase the lock level of synchronizer %p from read lock to write lock without first locking it for reading

source: Некорректный вызов метода увеличения уровня блокировки синхронизатора %p с блокировки на чтение до блокировки на запись
en: Incorrect call of the method required to increase the synchronizer lock level %p from read lock to write lock

source: Нельзя снять блокировку на чтение с синхронизатора %p, предварительно не заблокировав его на чтение
en: Failed to release read lock from synchronizer %p without first blocking it for reading

source: Нельзя снять блокировку на запись с синхронизатора %p, предварительно не заблокировав его на запись
en: Failed to release write lock from synchronizer %p without first blocking it for writing

source: Синхронизатор %p не может быть использован, т.к. он уже финализирован
en: Synchronizer %p cannot be used as it has already been finalized

source: Недопустимое кол-во объектов %d для выполнения операции ожидания
en: Invalid count of %d objects for waiting operation
